# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\projects\workspace\psoc\PSoC3Dialer\PSoc3dialer\PSoc3dialer.cydsn\PSoc3dialer.cyprj
# Date: Wed, 11 Jul 2012 11:12:20 GMT
#set_units -time ns
create_clock -name {ClockBlock/clk_bus} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus}]
create_clock -name {ClockBlock/dclk_0} -period 333.33333333333331 -waveform {0 166.666666666667} [get_pins {ClockBlock/dclk_0}]
create_clock -name {ClockBlock/dclk_1} -period 333.33333333333331 -waveform {0 166.666666666667} [get_pins {ClockBlock/dclk_1}]
create_clock -name {ClockBlock/dclk_2} -period 791.66666666666663 -waveform {0 395.833333333333} [get_pins {ClockBlock/dclk_2}]
create_clock -name {ClockBlock/aclk_0} -period 3208.333333333333 -waveform {0 1604.16666666667} [get_pins {ClockBlock/aclk_0}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -divide_by 8 -duty_cycle 50 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -divide_by 8 -duty_cycle 50 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_DelSig_1_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 19 39} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 77 155} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -duty_cycle 50 [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\projects\workspace\psoc\PSoC3Dialer\PSoc3dialer\PSoc3dialer.cydsn\TopDesign\TopDesign.cysch
# Project: D:\projects\workspace\psoc\PSoC3Dialer\PSoc3dialer\PSoc3dialer.cydsn\PSoc3dialer.cyprj
# Date: Wed, 11 Jul 2012 11:12:06 GMT
